БухЭксп/InformationRegisters/Отчетность24БРОЗапросы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Отчетность24БРОЗапросы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИДОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИДРедакцииОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяТипа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелоЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подтверждено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>45</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстДополнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отклонено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаПолученияЗапроса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/Отчетность24БРООграниченияПоОрганизациям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Отчетность24БРООграниченияПоОрганизациям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/Отчетность24БРОПодключения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Отчетность24БРОПодключения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребоватьПодтверждениеПользователя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Госорганы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/Отчетность24БРОНастройкиПодтверждения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Отчетность24БРОНастройкиПодтверждения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РазрешеноПодтверждениеОтправки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Пользователь</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/CommonModules/ИнтеграцияСОтчетность24/Ext/Module.bsl
// @skip-check bsl-legacy-check-string-literal

#Область СлужебныйПрограммныйИнтерфейс

#Область РегистрацияРегламентногоЗаданияВСервисе
// См. ОчередьЗаданийПереопределяемый.ПриПолученииСпискаШаблонов
Процедура ПриПолученииСпискаШаблонов(ШаблоныЗаданий) Экспорт

	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.ПолучениеСообщенийИзОтчетность24.Имя);

КонецПроцедуры

// См. ОчередьЗаданийПереопределяемый.ПриОпределенииПсевдонимовОбработчиков
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт

	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ПолучениеСообщенийИзОтчетность24.ИмяМетода);

КонецПроцедуры

// См. РегламентныеЗаданияПереопределяемый.ПриОпределенииНастроекРегламентныхЗаданий
Процедура ПриОпределенииНастроекРегламентныхЗаданий(Настройки) Экспорт
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ПолучениеСообщенийИзОтчетность24;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	Если Настройки.Колонки.Найти("ОбращаетсяКВнешнимРесурсам") <> Неопределено Тогда
		Настройка.ОбращаетсяКВнешнимРесурсам = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Возвращает параметры базы данных.
// 
// Возвращаемое значение:
//  Структура:
// * Имя                - Строка
// * АдресОбласти       - Строка
// * ИдентификаторБазы  - Строка
// * ЭтоФайловаяБаза    - Булево
// * ВерсияКонфигурации - Строка
// * Конфигурация       - Строка
Функция ПараметрыБазыДанных() Экспорт
	
	Результат = Новый Структура(); 
	Результат.Вставить("Имя", Строка(ОбменДаннымиПовтИсп.ИмяЭтойИнформационнойБазы()));
	Результат.Вставить("АдресОбласти", Отчетность24БРО.АдресОбласти());
	Результат.Вставить("ИдентификаторБазы", Отчетность24БРО.ИдентификаторБазы());
	Результат.Вставить("ЭтоФайловаяБаза", ОбщегоНазначения.ИнформационнаяБазаФайловая());
	Результат.Вставить("ВерсияКонфигурации", ИнтернетПоддержкаПользователей.ВерсияКонфигурации());
	Результат.Вставить("Конфигурация", 
		Строка(УдалитьВерсиюИзНаименованияКонфигурации(ИнтернетПоддержкаПользователей.СинонимКонфигурации())));
	
	Возврат Результат;
	
КонецФункции

// Возвращает параметры авторизации.
// 
// Параметры:
//  Соединение    - HTTPСоединение, Неопределено - Соединение
//  Принудительно - Булево - Принудительно
// 
// Возвращаемое значение:
//  Структура:
// * Токен    - Строка 
// * ТикетИТС - Строка 
Функция ПолучитьПараметрыАвторизации(Соединение = Неопределено, Принудительно = Ложь) Экспорт
	
	Возврат Отчетность24БРО.ПараметрыАвторизации(Соединение, Принудительно);
	
КонецФункции

// Устанавливает соединение с сервером интернета.
// 
// Параметры:
//  URLСервера     - Строка
//  ОписаниеОшибки - Строка
//  Таймаут        - Число
// 
// Возвращаемое значение:
//  Неопределено, HTTPСоединение - 
Функция УстановитьСоединениеССерверомИнтернета(URLСервера, ОписаниеОшибки = "", Таймаут = 60) Экспорт

	Возврат Отчетность24БРО.УстановитьСоединениеССерверомИнтернета(URLСервера, ОписаниеОшибки, Таймаут);
	
КонецФункции

// Записывает ошибку сервера в журнал регистрации.
// 
// Параметры:
//  Ответ - HTTPОтвет
Процедура ЗаписатьОшибкуСервераВЖурналРегистрации(Ответ) Экспорт
	Отчетность24БРО.ЗаписатьОшибкуСервераВЖурналРегистрации(Ответ);
КонецПроцедуры

// см. Отчетность24БРО.ИмяСобытияЖурналаРегистрации
Функция ИмяСобытияЖурналаРегистрации() Экспорт
	Возврат Отчетность24БРО.ИмяСобытияЖурналаРегистрации();
КонецФункции

// см. Отчетность24БРО.ВремяЖизниТокенаАвторизации
Функция ВремяЖизниТокенаАвторизации() Экспорт
	Возврат Отчетность24БРО.ВремяЖизниТокенаАвторизации();
КонецФункции

// Возвращает Госорган отчета.
// 
// Параметры:
//  ИДОтчета - Строка
// 
// Возвращаемое значение:
//  см. ИнтеграцияСОтчетность24ПовтИсп.ГосорганОтчета 
Функция ГосорганОтчета(ИДОтчета) Экспорт
	
	Возврат ИнтеграцияСОтчетность24ПовтИсп.ГосорганОтчета(ИДОтчета);
	
КонецФункции

// Получить настройки интеграции.
// 
// Параметры:
//  Получатель - Строка
// 
// Возвращаемое значение:
//  см. ИнтеграцияСОтчетность24ПовтИсп.ПолучитьНастройкиИнтеграции 
Функция ПолучитьНастройкиИнтеграции(Получатель) Экспорт
	
	Возврат ИнтеграцияСОтчетность24ПовтИсп.ПолучитьНастройкиИнтеграции(Получатель);
	
КонецФункции

// Добавляет новый запрос интеграции.
// 
// Параметры:
//  ПараметрыЗапроса - Структура:
// * Идентификатор        - Строка - 
// * Получатель           - Строка - 
// * Отправитель          - Строка - 
// * ИДОтчета             - Строка - 
// * ИДРедакцииОтчета     - Строка - 
// * ИмяТипа              - Строка - 
// * ТекстДополнения      - Строка - 
// * ДатаПолученияЗапроса - Дата - 
// * Организация          - ОпределяемыйТип.Организация 
// * ПериодОтчета         - Строка - 
// * ТелоЗапроса          - Строка - 
Процедура ДобавитьЗапросИнтеграции(ПараметрыЗапроса) Экспорт
	
	Запись = РегистрыСведений.Отчетность24БРОЗапросы.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, ПараметрыЗапроса);
	Запись.Записать();
	
КонецПроцедуры

// Обработка полученного сообщения
// 
// Параметры:
//  ЗаголовкиСообщения - Структура:
// * КодПолучателя  - Строка 
// * КодОтправителя - Строка 
// * Идентификатор  - Строка 
//  ТелоПоток       - Поток 
//  Отказ           - Булево 
Процедура ОбработатьПолученноеСообщение(ЗаголовкиСообщения, ТелоПоток, Отказ = Ложь) Экспорт
	
	НастройкиИнтеграции = ПолучитьНастройкиИнтеграции(ЗаголовкиСообщения.КодОтправителя);
	Если НастройкиИнтеграции = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РазмерБуфера = 1024;
	
	Тело  = Новый БуферДвоичныхДанных(0);
	Буфер = Новый БуферДвоичныхДанных(РазмерБуфера);
	
	ПрочитаноВсего = 0;
	Пока Истина Цикл
		Прочитано = ТелоПоток.Прочитать(Буфер, 0, РазмерБуфера);
		Если Прочитано > 0 Тогда
			Тело = Тело.Соединить(Буфер);
			ПрочитаноВсего = ПрочитаноВсего + Прочитано;
		КонецЕсли;

		Если Прочитано < РазмерБуфера Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	ТелоПоток.Закрыть();

	ЗапросJson = ПолучитьСтрокуИзБуфераДвоичныхДанных(Тело.Прочитать(0, ПрочитаноВсего));
	Попытка
		ДанныеЗапроса = Отчетность24БРОСериализация.JSONВЗначение(ЗапросJson, Ложь);
	Исключение
		ОписаниеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(
			ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,,,
			ОписаниеОшибки);
		Возврат;
	КонецПопытки;
	
	ВходящийКонтейнер = Неопределено;
	ИмяТипа = "";
	ЭтоОбъект = Ложь;
	ИмяСвойстваКонтейнер = "Контейнер";
	Если ТипЗнч(ДанныеЗапроса) = Тип("Структура") И ДанныеЗапроса.Свойство(ИмяСвойстваКонтейнер, ВходящийКонтейнер) Тогда
		
		Если ТипЗнч(ВходящийКонтейнер) = Тип("Строка") Тогда
			ВходящийКонтейнерХранилище = XMLЗначение(Тип("ХранилищеЗначения"), ВходящийКонтейнер); // ХранилищеЗначения
			Если ВходящийКонтейнерХранилище <> Неопределено Тогда
				КонтейнерJSON = ВходящийКонтейнерХранилище.Получить(); // Строка
				Попытка
					НовыйВходящийКонтейнер = Отчетность24БРОСериализация.JSONВЗначение(
						КонтейнерJSON, Ложь);
				Исключение
					ОписаниеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
					ЗаписьЖурналаРегистрации(
					ИмяСобытияЖурналаРегистрации(),
					УровеньЖурналаРегистрации.Ошибка,,,
					ОписаниеОшибки);
					Возврат;
				КонецПопытки;
				ДанныеЗапроса[ИмяСвойстваКонтейнер] = НовыйВходящийКонтейнер;
			КонецЕсли;
		КонецЕсли;	
		
		ДанныеЗапросаКонтейнер = ДанныеЗапроса[ИмяСвойстваКонтейнер]; // Структура
		Если ТипЗнч(ДанныеЗапросаКонтейнер) = Тип("Структура") И ДанныеЗапросаКонтейнер.Свойство("ИмяТипа", ИмяТипа) Тогда
			ЭтоОбъект = Истина;
		КонецЕсли;
		
	КонецЕсли;

	ИДОтчета = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗапроса, "ИДОтчета", ""); // Строка
	ИДРедакцииОтчета = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗапроса, "ИДРедакцииОтчета", ""); // Строка
	ПараметрыОтчета = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗапроса, "ПараметрыОтчета", Новый Структура); // Структура
	
	// Доступ в разрезе госорганов
	Если ЭтоОбъект Тогда 
		ГосорганОтчета = ИнтеграцияСОтчетность24КлиентСервер.ГосорганПоИмениТипа(ИмяТипа);
	Иначе
		ГосорганОтчета = ГосорганОтчета(ИДОтчета);
	КонецЕсли;
	
	ТранспортныйКонтейнер = НовыйТранспортныйКонтейнер();
	
	ОрганизацияОтчета = Неопределено;
	НачалоПериодаОтчета = Дата(1, 1, 1);
	КонецПериодаОтчета = Дата(1, 1, 1);
	ТекстДополнения = "";
	ИмяСвойстваДанные = "Данные";
	ИмяСвойстваПараметрыОтчета = "ПараметрыОтчета";
	Если ЭтоОбъект Тогда
		Если ИмяТипа = "СправочникОбъект.ФизическиеЛица" Тогда
			ДанныеЗапросаКонтейнер = ДанныеЗапроса[ИмяСвойстваКонтейнер];  // Структура
			ДанныеЗапросаКонтейнерДанные = ДанныеЗапросаКонтейнер[ИмяСвойстваДанные]; // Структура  
			ДанныеЗапросаКонтейнерДанные.Свойство("Организация", ОрганизацияОтчета);
		Иначе
			ДанныеЗапросаКонтейнер = ДанныеЗапроса[ИмяСвойстваКонтейнер];  // Структура
			ДанныеЗапросаКонтейнерДанные = ДанныеЗапросаКонтейнер[ИмяСвойстваДанные]; // Структура  
			ДанныеЗапросаКонтейнерДанные.Свойство("Организация", ОрганизацияОтчета);
			
			ДанныеЗапросаКонтейнерДанные.Свойство("ОтчетныйПериод", НачалоПериодаОтчета);
			ДанныеЗапросаКонтейнерДанные.Свойство("ОкончаниеОтчетногоПериода", КонецПериодаОтчета);
			Если ЗначениеЗаполнено(КонецПериодаОтчета) = Ложь Тогда
				ДанныеЗапросаКонтейнерДанные.Свойство("Дата", КонецПериодаОтчета);
			КонецЕсли;
			ДанныеЗапросаКонтейнерДанные.Свойство("КраткийСоставДокумента", ТекстДополнения);
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеЗапроса) = Тип("Структура") И ДанныеЗапроса.Свойство("ПараметрыОтчета") Тогда
		ДанныеЗапросаПараметрыОтчета = ДанныеЗапроса[ИмяСвойстваПараметрыОтчета]; // Структура
		ДанныеЗапросаПараметрыОтчета.Свойство("Организация", ОрганизацияОтчета);
		
		ДанныеЗапросаПараметрыОтчета.Свойство("мДатаНачалаПериодаОтчета", НачалоПериодаОтчета);
		Если Не ЗначениеЗаполнено(НачалоПериодаОтчета) Тогда
			ДанныеЗапросаПараметрыОтчета.Свойство("ДатаНачалаПериодаОтчета", НачалоПериодаОтчета);
		КонецЕсли;
		
		ДанныеЗапросаПараметрыОтчета.Свойство("мДатаКонцаПериодаОтчета", КонецПериодаОтчета);
		Если Не ЗначениеЗаполнено(КонецПериодаОтчета) Тогда
			ДанныеЗапросаПараметрыОтчета.Свойство("ДатаКонцаПериодаОтчета", КонецПериодаОтчета);
		КонецЕсли;
	КонецЕсли;
	
	СправочныеДанные = (ИмяТипа = "СправочникОбъект.ФизическиеЛица"
		Или ИмяТипа = "СправочникОбъект.БанковскиеСчета");

	Если Не ЗначениеЗаполнено(ОрганизацияОтчета) И Не СправочныеДанные Тогда
		ТранспортныйКонтейнер.ТекстОшибки = НСтр("ru = 'В учетной базе нет данных для заполнения по этой организации'");
	ИначеЕсли Не ЗначениеЗаполнено(ГосорганОтчета) Тогда
		ТранспортныйКонтейнер.ДоступРазрешен = Истина;
	Иначе
		ТранспортныйКонтейнер.Госорган = ГосорганОтчета;
		Если СтрНайти(НастройкиИнтеграции.Госорганы, ГосорганОтчета) = 0 Тогда
			ТранспортныйКонтейнер.ТекстОшибки= НСтр("ru = 'Доступ к данным заполнения отчета для'") 
				+ СтрШаблон(" %1 запрещен", ГосорганОтчета);
		Иначе
			ТранспортныйКонтейнер.ДоступРазрешен = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// Доступ в разрезе организаций
	Если ТранспортныйКонтейнер.ДоступРазрешен Тогда
		Если ЗначениеЗаполнено(ОрганизацияОтчета) Тогда
			НаборОграничениеПередачиДанных = РегистрыСведений.Отчетность24БРООграниченияПоОрганизациям.СоздатьНаборЗаписей();
			НаборОграничениеПередачиДанных.Отбор.Получатель.Установить(ЗаголовкиСообщения.КодОтправителя);
			НаборОграничениеПередачиДанных.Прочитать();
			Если НаборОграничениеПередачиДанных.Количество() > 0 Тогда
				Для Каждого ЗаписьНабора Из НаборОграничениеПередачиДанных Цикл
					Если ЗаписьНабора.Организация = ОрганизацияОтчета Тогда
						ТранспортныйКонтейнер.ДоступРазрешен = Истина;
						Прервать;
					Иначе
						ТранспортныйКонтейнер.ДоступРазрешен = Ложь;
					КонецЕсли;
				КонецЦикла;
				Если ТранспортныйКонтейнер.ДоступРазрешен = Ложь Тогда
					ТранспортныйКонтейнер.ТекстОшибки = НСтр("ru = 'Доступ к данным по организации'") 
						+ СтрШаблон(" %1 запрещен", ОрганизацияОтчета);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ТранспортныйКонтейнер.ИДОтчета = ИДОтчета;
	ТранспортныйКонтейнер.ИДРедакцииОтчета = ИДРедакцииОтчета;
	ТранспортныйКонтейнер.ИмяТипа = ИмяТипа;
	
	ЕстьОтчет = Ложь;
	ЕстьВерсия = Ложь;
	
	Если Не ЭтоОбъект Тогда
		
		ИДРедакцииОтчетаДляЗаполнения = ИДРедакцииОтчета; // Строка
		
		МетаданныеОтчета = Метаданные.Отчеты.Найти(ИДОтчета);
		ЕстьОтчет = МетаданныеОтчета <> Неопределено;
		ЕстьВерсия = Ложь;
		Если МетаданныеОтчета <> Неопределено Тогда
			ЕстьВерсия = МетаданныеОтчета.Формы.Найти(ИДРедакцииОтчета) <> Неопределено;
		КонецЕсли;

		СкорректироватьПараметрыОтчета(ПараметрыОтчета, ИДОтчета, ТранспортныйКонтейнер);
		
		ЕстьОтчет = ЕстьОтчет // проверка наличия отчета в регламентированных
			И ИнтеграцияСОтчетность24ПовтИсп.ЕстьВСправочникеРегламентированных(ИДОтчета);

		Если ЕстьОтчет И Не ЕстьВерсия Тогда
			// Подбор наиболее актуальной формы, если нет запрашиваемой
			ИДРедакцииОтчетаДляЗаполнения = ПодобратьРедакциюОтчета(МетаданныеОтчета, ИДРедакцииОтчета);
			Если ИДРедакцииОтчетаДляЗаполнения <> ИДРедакцииОтчета Тогда
				ТранспортныйКонтейнер.ИДРедакцииОтчета = ИДРедакцииОтчетаДляЗаполнения; 
			КонецЕсли;
		КонецЕсли;
		
		ЕстьОтчет = ЕстьОтчет // проверка заполняемости с учетов периода отчета 
			И РеализованоЗаполнениеНаФорме(ИДОтчета, Строка(ИДРедакцииОтчетаДляЗаполнения), ПараметрыОтчета);
			
	КонецЕсли;
	
	
	Если ТранспортныйКонтейнер.ДоступРазрешен Тогда
		Если НастройкиИнтеграции.ТребоватьПодтверждениеПользователя = Ложь 
			Или (Не ЭтоОбъект И Не ЕстьОтчет) Тогда
			ДобавитьРезультатЗаполненияВТранспортныйКонтейнер(ТранспортныйКонтейнер, ДанныеЗапроса);
		Иначе
			ПараметрыЗапроса = Новый Структура;
			ПараметрыЗапроса.Вставить("Идентификатор", ЗаголовкиСообщения.Идентификатор);
			ПараметрыЗапроса.Вставить("Получатель", ЗаголовкиСообщения.КодПолучателя);
			ПараметрыЗапроса.Вставить("Отправитель", ЗаголовкиСообщения.КодОтправителя);
			ПараметрыЗапроса.Вставить("ИДОтчета", ИДОтчета);
			ПараметрыЗапроса.Вставить("ИДРедакцииОтчета", ИДРедакцииОтчета);
			ПараметрыЗапроса.Вставить("ИмяТипа", ИмяТипа);
			ПараметрыЗапроса.Вставить("ТекстДополнения", ТекстДополнения);
			ПараметрыЗапроса.Вставить("ДатаПолученияЗапроса", ТекущаяДатаСеанса());
			Если ЗначениеЗаполнено(ОрганизацияОтчета) Тогда
				ПараметрыЗапроса.Вставить("Организация", ОрганизацияОтчета);
			КонецЕсли;
			Если ЗначениеЗаполнено(НачалоПериодаОтчета)
				Или ЗначениеЗаполнено(КонецПериодаОтчета) Тогда
				
				Если Не ЗначениеЗаполнено(НачалоПериодаОтчета) Тогда
					НачалоПериодаОтчета = КонецПериодаОтчета; // Дата
				ИначеЕсли Не ЗначениеЗаполнено(КонецПериодаОтчета) Тогда
					КонецПериодаОтчета = НачалоПериодаОтчета;
				ИначеЕсли КонецПериодаОтчета < НачалоПериодаОтчета Тогда
					КонецПериодаОтчета = НачалоПериодаОтчета;  // Дата
				КонецЕсли;
				ПараметрыЗапроса.Вставить("ПериодОтчета", ПредставлениеПериода(
					НачалоДня(НачалоПериодаОтчета),
					КонецДня(КонецПериодаОтчета),
					"Л=ru_RU;ФП=Истина"));
			КонецЕсли;
			ПараметрыЗапроса.Вставить("ТелоЗапроса", ЗапросJson);
			ДобавитьЗапросИнтеграции(ПараметрыЗапроса);
			
			СистемнаяИнформация = Новый СистемнаяИнформация;
			Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии("8.3.26.0", СистемнаяИнформация.ВерсияПриложения) <= 0 Тогда
				//@skip-check module-unused-local-variable - используется в ВыполнитьВБезопасномРежиме
				ИмяУведомления = Отчетность24БРОКлиентСервер.ИмяУведомленияСообщениеИзШиныОтчетности();
				ДанныеСообщения = Новый Структура();
				ДанныеСообщения.Вставить("Идентификатор", ПараметрыЗапроса.Идентификатор);
				
				УстановитьБезопасныйРежим(Истина);
				// АПК:488-выкл Поддержка новых методов платформы (исполняемый код безопасен)
				Выполнить "УведомленияКлиента.ОтправитьУведомление(ИмяУведомления, ДанныеСообщения)"; // Не нарушает безопасность информации, так как вычисляется фиксированная строка, содержащая только вызов метода платформы.
				// АПК:488-вкл
				УстановитьБезопасныйРежим(Ложь);
			КонецЕсли;
	
			Возврат;
		КонецЕсли;
	Иначе
		ТранспортныйКонтейнер.Вставить("ЕстьВерсия");
	КонецЕсли;
	
	ОтправитьТранспортныйКонтейнер(
		ТранспортныйКонтейнер,
		ЗаголовкиСообщения.КодПолучателя,
		ЗаголовкиСообщения.КодОтправителя,
		ЗаголовкиСообщения.Идентификатор);
		
КонецПроцедуры
	
// Заполняет методы под требование безопасности при использовании ВыполнитьВБезопасномРежиме
// 
// Параметры:
//  Методы - Структура - СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ПолучитьСообщенияПоHttp", Истина);
	Методы.Вставить("ОбработатьОтложенныеЗапросы", Истина);
	Методы.Вставить("РегламентноеЗаданиеПолучениеСообщенийИзОтчетность24");
КонецПроцедуры

// Возвращает наличие прав на подтверждение отправки данных в Отчетность.
// 
// Возвращаемое значение:
//  Булево
Функция РазрешеноПодтверждениеОтправкиДанныхОтчетов() Экспорт
	
	Результат = Ложь;

	//@skip-check using-isinrole
	Если РольДоступна(Метаданные.Роли.ПодтверждениеОтправкиДанныхВОтчетность24) 
		Или РольДоступна(Метаданные.Роли.ПолныеПрава) Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции
	
// Получить запросы интеграции для формы подтверждения.
// 
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение -:
//  * Ключ - Строка
//  * Значение - Массив Из Структура - Массив данных запросов на интеграцию:
//  ** Идентификатор    - Строка
//  ** Получатель       - Строка
//  ** Отправитель      - Строка
//  ** ИДОтчета         - Строка
//  ** ИДРедакцииОтчета - Строка
//  ** ИмяТипа          - Строка
//  ** ИмяПодключения   - Строка
//  ** АдресПолучателя  - Строка
//  ** Организация      - СправочникСсылка.Организации
//  ** ПериодОтчета     - Строка
Функция ПолучитьЗапросыИнтеграцииДляФормыПодтверждения() Экспорт

	Если Не РазрешеноПодтверждениеОтправкиДанныхОтчетов() Тогда
		// у пользователя нет прав на создание и соответственно подтверждение отчетов
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации";
	
	Попытка
		РазрешенныеОрганизации = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Исключение
		// у пользователя нет прав на организации
		Возврат Неопределено;
	КонецПопытки;
	
	Если ПривилегированныйРежим() = Ложь Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Результат = Новый Соответствие();

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗапросыПодтверждения.Идентификатор КАК Идентификатор,
	|	ЗапросыПодтверждения.Получатель КАК Получатель,
	|	ЗапросыПодтверждения.Отправитель КАК Отправитель,
	|	ЗапросыПодтверждения.ИДОтчета КАК ИДОтчета,
	|	ЗапросыПодтверждения.ИДРедакцииОтчета КАК ИДРедакцииОтчета,
	|	ЗапросыПодтверждения.ИмяТипа КАК ИмяТипа,
	|	Отчетность24Подключения.Имя КАК ИмяПодключения,
	|	Отчетность24Подключения.АдресПолучателя КАК АдресПолучателя,
	|	ЗапросыПодтверждения.Организация КАК Организация,
	|	ЗапросыПодтверждения.ПериодОтчета КАК ПериодОтчета,
	|	ЕСТЬNULL(НастройкиПодтвержденияПередачиДанныхВОблачнуюОтчетность.Пользователь, ""ВсеПользователи"") КАК Пользователь
	|ИЗ
	|	РегистрСведений.Отчетность24БРОЗапросы КАК ЗапросыПодтверждения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Отчетность24БРОПодключения КАК
	|			Отчетность24Подключения
	|		ПО ЗапросыПодтверждения.Отправитель = Отчетность24Подключения.Получатель
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Отчетность24БРОНастройкиПодтверждения КАК
	|			НастройкиПодтвержденияПередачиДанныхВОблачнуюОтчетность
	|		ПО ЗапросыПодтверждения.Отправитель = НастройкиПодтвержденияПередачиДанныхВОблачнуюОтчетность.Получатель
	|		И НастройкиПодтвержденияПередачиДанныхВОблачнуюОтчетность.РазрешеноПодтверждениеОтправки
	|ГДЕ
	|	ЗапросыПодтверждения.Подтверждено = ЛОЖЬ
	|	И ЗапросыПодтверждения.Отклонено = ЛОЖЬ
	|	И ( ЗапросыПодтверждения.Организация В (&РазрешенныеОрганизации)
	|	ИЛИ ЗапросыПодтверждения.Организация = Значение(Справочник.Организации.ПустаяСсылка))
	|ИТОГИ
	|ПО
	|	Пользователь";
	
	Запрос.УстановитьПараметр("РазрешенныеОрганизации", РазрешенныеОрганизации);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда  
		МассивКолонок = Новый Массив; // Массив Из Строка
		Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
			МассивКолонок.Добавить(Колонка.Имя);
		КонецЦикла; 
		СписокКолонок = СтрСоединить(МассивКолонок, ",");
		
		ИмяКолонкиПользователь = "Пользователь";
		
		ВыборкаПользователь = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПользователь.Следующий() Цикл   
			МассивЗапросов = Новый Массив; // Массив Из Структура
			Выборка = ВыборкаПользователь.Выбрать(); 
			Пока Выборка.Следующий() Цикл
				ОтложенныйЗапрос = Новый Структура(СписокКолонок);
				ЗаполнитьЗначенияСвойств(ОтложенныйЗапрос, Выборка);
				МассивЗапросов.Добавить(ОтложенныйЗапрос);
			КонецЦикла;
			Если МассивЗапросов.Количество() > 0 Тогда
				Результат.Вставить(ВыборкаПользователь[ИмяКолонкиПользователь], МассивЗапросов);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;  
	
	Возврат Результат;
	
КонецФункции

// Выполняет получение сообщения по http.
// 
// Параметры:
//  ОписаниеОшибки - Строка - Описание ошибки
//  ПовторАвторизации - Булево - Повтор авторизации
// 
// Возвращаемое значение:
//  Булево
Функция ПолучитьСообщенияПоHttp(ОписаниеОшибки = "", ПовторАвторизации = Ложь) Экспорт

	Результат = Ложь; // Булево

	Если ПривилегированныйРежим() = Ложь Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Если Не ИнтеграцияСОтчетность24ВызовСервера.ЕстьНастроенныеИнтеграции() Тогда
		Возврат Ложь;
	КонецЕсли;

	АдресаШины = АдресаШины();
	Соединение = УстановитьСоединениеССерверомИнтернета(АдресаШины.Сервер, ОписаниеОшибки);

	Если Соединение <> Неопределено Тогда

		ПараметрыАвторизации = ПолучитьПараметрыАвторизации(Соединение, ПовторАвторизации);
		Если Не ЗначениеЗаполнено(ПараметрыАвторизации.Токен) Тогда
			ОписаниеОшибки = НСтр("ru='Не удалось авторизоваться в сервисе 1С-Отчетность'");
			Возврат Результат;
		КонецЕсли;

		ЗапросHttp = Новый HTTPЗапрос;
		ЗапросHttp.АдресРесурса = АдресаШины.ПолучитьСообщение;
		ЗапросHttp.Заголовки.Вставить(НРег("TicketITS"), ПараметрыАвторизации.ТикетИТС);
		ЗапросHttp.Заголовки.Вставить(НРег("TicketControl"), КонтрольнаяСуммаТикетаИТС(ПараметрыАвторизации.ТикетИТС));
		ЗапросHttp.Заголовки.Вставить(НРег("Authorization"), "Bearer " + ПараметрыАвторизации.Токен);
		ЗапросHttp.Заголовки.Вставить(НРег("MessageLifeTime"), 400);

		Попытка
				//@skip-check bsl-legacy-check-dynamic-feature-access
			Ответ = Соединение.ВызватьHTTPМетод("GET", ЗапросHttp); // HTTPОтвет
		Исключение
			ОписаниеОшибки = НСтр("ru='Не удалось получить сообщение в сервисе 1С-Отчетность'")
				+ ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Возврат Результат;
		КонецПопытки;

		Если Ответ.КодСостояния = 200 Тогда

			RecipientCode = ЗначениеЗаголовкаHTTP(Ответ.Заголовки, "RecipientCode");
			SenderCode = ЗначениеЗаголовкаHTTP(Ответ.Заголовки, "SenderCode");
			MessageId = ЗначениеЗаголовкаHTTP(Ответ.Заголовки, "MessageId");

			ЗаголовкиСообщения = ЗаголовкиСообщения(RecipientCode, SenderCode, MessageId);
			Если ЗначениеЗаполнено(ЗаголовкиСообщения.Идентификатор) Тогда
				ОбработатьПолученноеСообщение(ЗаголовкиСообщения, Ответ.ПолучитьТелоКакПоток());
				ПолучитьСообщенияПоHttp(ОписаниеОшибки); // цикл получения всех сообщений из очереди
				Результат = Истина;
			КонецЕсли;

		ИначеЕсли (Ответ.КодСостояния = 500 Или Ответ.КодСостояния = 401) И Не ПовторАвторизации Тогда
			Результат = ПолучитьСообщенияПоHttp(ОписаниеОшибки, Истина); // Булево
		Иначе
			ЗаписатьОшибкуСервераВЖурналРегистрации(Ответ);
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Отправить транспортный контейнер.
// 
// Параметры:
//  ТранспортныйКонтейнер - Структура:
// * Госорган               - Строка - 
// * ДоступРазрешен         - Булево  
// * ТекстОшибки            - Строка
// * ВерсияБРО              - Строка
// * КонфигурацияИмя        - Строка
// * КонфигурацияВерсия     - Строка
// * ИДОтчета               - Строка - 
// * ИДРедакцииОтчета       - Строка - 
// * ИмяТипа                - Строка - 
// * ЕстьВерсия             - Булево
// * ВерсияЗаполненияДанных - Строка
//  КодОтправителя                - Строка 
//  КодПолучателя                 - Строка 
//  ИдентификаторСообщенияЗапроса - Строка 
Процедура ОтправитьТранспортныйКонтейнер(ТранспортныйКонтейнер, КодОтправителя, КодПолучателя, ИдентификаторСообщенияЗапроса) Экспорт
	
	РезультатJson = Отчетность24БРОСериализация.ЗначениеВJSON(ТранспортныйКонтейнер);
	
	РезультатДвоичный = ПолучитьДвоичныеДанныеИзСтроки(РезультатJson);

	АдресаШины = АдресаШины();
	ОписаниеОшибки = "";
	Соединение = УстановитьСоединениеССерверомИнтернета(АдресаШины.Сервер, ОписаниеОшибки);

	Если Соединение <> Неопределено Тогда
		ПараметрыАвторизации = ПолучитьПараметрыАвторизации(Соединение);

		Если Не ЗначениеЗаполнено(ПараметрыАвторизации.Токен) Тогда
			Возврат;
		КонецЕсли;

		Для СчетчикЦикла = 1 По 2 Цикл
			ЗапросHttp = Новый HTTPЗапрос;
			ЗапросHttp.АдресРесурса = АдресаШины.Ответ;
			ЗапросHttp.Заголовки.Вставить(НРег("TicketITS"), ПараметрыАвторизации.ТикетИТС);
			ЗапросHttp.Заголовки.Вставить(НРег("TicketControl"), КонтрольнаяСуммаТикетаИТС(
				ПараметрыАвторизации.ТикетИТС));
			ЗапросHttp.Заголовки.Вставить(НРег("Participant-Sender-Code"), КодОтправителя);
			ЗапросHttp.Заголовки.Вставить(НРег("Participant-Receiver-Codes"), КодПолучателя);
			ЗапросHttp.Заголовки.Вставить(НРег("CorrelationId"), ИдентификаторСообщенияЗапроса);
			ЗапросHttp.Заголовки.Вставить(НРег("Authorization"), "Bearer " + ПараметрыАвторизации.Токен);

			ЗапросHttp.Заголовки.Вставить(НРег("ReportName"), КодироватьСтроку(ТранспортныйКонтейнер.ИДОтчета,
				СпособКодированияСтроки.КодировкаURL));
			ЗапросHttp.Заголовки.Вставить(НРег("ConfigName"), КодироватьСтроку(Метаданные.Имя,
				СпособКодированияСтроки.КодировкаURL));
			ЗапросHttp.Заголовки.Вставить(НРег("ConfigSynonym"), КодироватьСтроку(Метаданные.Синоним,
				СпособКодированияСтроки.КодировкаURL));
			ЗапросHttp.Заголовки.Вставить(НРег("ConfigVersion"), КодироватьСтроку(Метаданные.Версия,
				СпособКодированияСтроки.КодировкаURL));
			ЗапросHttp.Заголовки.Вставить(НРег("ReportForm"), КодироватьСтроку(ТранспортныйКонтейнер.ИДРедакцииОтчета,
				СпособКодированияСтроки.КодировкаURL));
			ЗапросHttp.Заголовки.Вставить(НРег("TypeName"), КодироватьСтроку(ТранспортныйКонтейнер.ИмяТипа,
				СпособКодированияСтроки.КодировкаURL));
				
			Если ЗначениеЗаполнено(ТранспортныйКонтейнер.ИмяТипа) Тогда
				ЗапросHttp.Заголовки.Вставить(НРег("SubsystemName"), КодироватьСтроку("БЗК",
					СпособКодированияСтроки.КодировкаURL));
				ЗапросHttp.Заголовки.Вставить(НРег("SubsystemVersion"), Отчетность24БРО.ВерсияБЗК());
			Иначе
				ЗапросHttp.Заголовки.Вставить(НРег("SubsystemName"), КодироватьСтроку("БРО",
					СпособКодированияСтроки.КодировкаURL));
				ЗапросHttp.Заголовки.Вставить(НРег("SubsystemVersion"), Отчетность24БРО.ВерсияБРО());
			КонецЕсли;
				
			ЗапросHttp.Заголовки.Вставить(НРег("EqualVersion"), XMLСтрока(ТранспортныйКонтейнер.ЕстьВерсия));
			Если ТранспортныйКонтейнер.Свойство("ВерсияЗаполненияДанных") Тогда
				ЗапросHttp.Заголовки.Вставить(НРег("DataVersion"), КодироватьСтроку(
					ТранспортныйКонтейнер.ВерсияЗаполненияДанных, СпособКодированияСтроки.КодировкаURL));
			КонецЕсли;

			ЗапросHttp.УстановитьТелоИзДвоичныхДанных(РезультатДвоичный);

			Попытка
				Ответ = Соединение.ВызватьHTTPМетод("POST", ЗапросHttp);
			Исключение
				ОписаниеОшибки = НСтр("ru='Не удалось получить сообщение в сервисе 1С-Отчетность'");
				Возврат;
			КонецПопытки;

			Если Ответ.КодСостояния = 200 Тогда
					
					// отправка уведомление в отчетность для получения сообщений из шины
				КлючМаршрутизации = "db." + ВРег(Сред(КодПолучателя, 3));
				СообщениеНаШинуУведомления = Отчетность24БРОШинаСлужебный.НовоеСообщениеДляОтправки(КлючМаршрутизации);
				Отчетность24БРОШинаУведомления.ОтправитьСообщение(СообщениеНаШинуУведомления);

				Прервать;
			ИначеЕсли (Ответ.КодСостояния = 500 Или Ответ.КодСостояния = 401) И СчетчикЦикла = 1 Тогда
					// Возможно токен закончился в процессе выполнения (или изменился срок жизни токена в шине)
				ПараметрыАвторизации = ПолучитьПараметрыАвторизации(Соединение, Истина);
				Если Не ЗначениеЗаполнено(ПараметрыАвторизации.Токен) Тогда
					Возврат;
				КонецЕсли;
			Иначе
				ЗаписатьОшибкуСервераВЖурналРегистрации(Ответ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

// Добавить результат заполнения в транспортный контейнер.
// 
// Параметры:
//  ТранспортныйКонтейнер - см. НовыйТранспортныйКонтейнер() 
//  ДанныеЗапроса - Структура -
Процедура ДобавитьРезультатЗаполненияВТранспортныйКонтейнер(ТранспортныйКонтейнер, ДанныеЗапроса) Экспорт

	ЕстьОтчет = Ложь;
	ЕстьВерсия = Ложь;
	
	Контейнер = Неопределено;
	Если ДанныеЗапроса.Свойство("Контейнер", Контейнер) = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТипа = ""; 
	Если ТипЗнч(Контейнер) = Тип("Структура") Тогда
		Контейнер.Свойство("ИмяТипа", ИмяТипа);
	КонецЕсли;
	
	ИДОтчета = "";
	ИДРедакцииОтчета = "";
	ПараметрыОтчета = Новый Структура;
	
	ЭтоЗапросОтчета = Не ЗначениеЗаполнено(ИмяТипа); 
	
	Если ЭтоЗапросОтчета Тогда

		Если (ДанныеЗапроса.Свойство("ИДОтчета", ИДОтчета) = Ложь 
			Или ДанныеЗапроса.Свойство("ИДРедакцииОтчета", ИДРедакцииОтчета) = Ложь 
			Или ДанныеЗапроса.Свойство("ПараметрыОтчета", ПараметрыОтчета) = Ложь) Тогда
			// неверный формат параметров запроса
			Возврат;
		КонецЕсли;
		
		ИДРедакцииОтчетаДляЗаполнения = ИДРедакцииОтчета; // Строка
		
		МетаданныеОтчета = Метаданные.Отчеты.Найти(ИДОтчета);
		ЕстьОтчет = МетаданныеОтчета <> Неопределено;
		ЕстьВерсия = Ложь;
		Если МетаданныеОтчета <> Неопределено Тогда
			ЕстьВерсия = МетаданныеОтчета.Формы.Найти(ИДРедакцииОтчета) <> Неопределено;
		КонецЕсли;

		СкорректироватьПараметрыОтчета(ПараметрыОтчета, ИДОтчета, Контейнер);
		
		ЕстьОтчет = ЕстьОтчет // проверка наличия отчета в регламентированных
			И ИнтеграцияСОтчетность24ПовтИсп.ЕстьВСправочникеРегламентированных(ИДОтчета);

		Если ЕстьОтчет И Не ЕстьВерсия Тогда
			// Подбор наиболее актуальной формы, если нет запрашиваемой
			ИДРедакцииОтчетаДляЗаполнения = ПодобратьРедакциюОтчета(МетаданныеОтчета, ИДРедакцииОтчета);
		КонецЕсли;

		ТранспортныйКонтейнер.ИДОтчета = ИДОтчета;
		ТранспортныйКонтейнер.ИмяТипа = ИмяТипа;
		ТранспортныйКонтейнер.ИДРедакцииОтчета = ИДРедакцииОтчетаДляЗаполнения;
		
		ЕстьОтчет = ЕстьОтчет // проверка заполняемости с учетов периода отчета 
			И РеализованоЗаполнениеНаФорме(ИДОтчета, Строка(ИДРедакцииОтчетаДляЗаполнения), ПараметрыОтчета);
		
		Если ЕстьОтчет Тогда
			
			КонтейнерКонтрольнаяСуммаДо = ОбщегоНазначения.КонтрольнаяСуммаСтрокой(
				Отчетность24БРОСериализация.ЗначениеВJSON(Контейнер));
			
			Попытка
				//@skip-check invocation-parameter-type-intersect
				РегламентированнаяОтчетностьПереопределяемый.ЗаполнитьОтчет(
				ИДОтчета, 
				ИДРедакцииОтчетаДляЗаполнения, 
				ПараметрыОтчета, 
				Контейнер);

				КонтейнерКонтрольнаяСуммаПосле = ОбщегоНазначения.КонтрольнаяСуммаСтрокой(
					Отчетность24БРОСериализация.ЗначениеВJSON(Контейнер));
				
				Если КонтейнерКонтрольнаяСуммаДо = КонтейнерКонтрольнаяСуммаПосле Тогда
					КлючСвойства = "ТекстСообщения";
					Если Не ТранспортныйКонтейнер.Свойство(КлючСвойства) Тогда
						ТранспортныйКонтейнер.Вставить(КлючСвойства);
					КонецЕсли;

					ТранспортныйКонтейнер[КлючСвойства] =
					НСтр("ru='Нет данных для заполнения отчета или учетная база
					|не поддерживает заполнение и передачу отчета в 1С:Отчетность 24'");
				КонецЕсли;

			Исключение

				КлючСвойства = "ТекстОшибки";
				Если Не ТранспортныйКонтейнер.Свойство(КлючСвойства) Тогда
					ТранспортныйКонтейнер.Вставить(КлючСвойства);
				КонецЕсли;
				
				Если ИДРедакцииОтчетаДляЗаполнения = ИДРедакцииОтчета Тогда
					ТранспортныйКонтейнер.ТекстОшибки = 
						НСтр("ru='Произошла ошибка при формировании данных отчета в учетной базе'");
				Иначе
					ТранспортныйКонтейнер.ТекстОшибки = 
						НСтр("ru='В учетной базе не поддерживается заполнение
						|данной редакции отчета.'");
					ТранспортныйКонтейнер.ТекстРекомендаций = 
						НСтр("ru='Возможно, необходимо обновить конфигурацию учетной базы.'");
				КонецЕсли;

				КлючСвойства = "ПодробноеПредставлениеОшибки";
				Если Не ТранспортныйКонтейнер.Свойство(КлючСвойства) Тогда
					ТранспортныйКонтейнер.Вставить(КлючСвойства);
				КонецЕсли;
				ТранспортныйКонтейнер.ПодробноеПредставлениеОшибки = 
					ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					
				ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,,
					ТранспортныйКонтейнер.ПодробноеПредставлениеОшибки);
					
			КонецПопытки;
		Иначе
			КлючСвойства = "ТекстОшибки";
			Если Не ТранспортныйКонтейнер.Свойство(КлючСвойства) Тогда
				ТранспортныйКонтейнер.Вставить(КлючСвойства);
			КонецЕсли;
			
			ТранспортныйКонтейнер.ТекстОшибки = 
			НСтр("ru='В учетной базе не предусмотрено заполнение данного отчета'");
		КонецЕсли;
		
		Если СтрНачинаетсяС(ИДОтчета, "РегламентированныйОтчетАлко") Тогда
			КлючСвойства = "ДокументСсылка";
			ПараметрыОтчета[КлючСвойства] = Неопределено;
		КонецЕсли;
			
		КлючСвойства = "ВерсияЗаполненияДанных";
		Если ПараметрыОтчета.Свойство(КлючСвойства) Тогда
			ТранспортныйКонтейнер.Вставить("ВерсияЗаполненияДанных", ПараметрыОтчета[КлючСвойства]);
		КонецЕсли; 
			
		КлючСвойства = "АдресВоВременномХранилище";
		Если ПараметрыОтчета.Свойство(КлючСвойства) Тогда
			Результат = ПолучитьИзВременногоХранилища(Строка(ПараметрыОтчета[КлючСвойства]));
		КонецЕсли;
		Если Результат = Неопределено Тогда
			Результат = Контейнер;	
		КонецЕсли;    
	Иначе
		
		ТранспортныйКонтейнер.ИмяТипа = ИмяТипа;
		
	КонецЕсли;
	
	ТранспортныйКонтейнер.Вставить("ЕстьОтчет", ЕстьОтчет);
	ТранспортныйКонтейнер.Вставить("ЕстьВерсия", ЕстьВерсия);

	// Дозагрузка данных сотрудников по флагу из приложения-приёмника:
	// вместе с результатом заполнения отчета/документа в ответ вкладывается массив данных сотрудников.
	ПараметрыЗаполненияЗапроса = Неопределено;
	ПараметрыОтчетаЗапроса = Неопределено;
	Если ДанныеЗапроса.Свойство("ПараметрыОтчета", ПараметрыОтчетаЗапроса)
		И ТипЗнч(ПараметрыОтчетаЗапроса) = Тип("Структура") Тогда
		ПараметрыОтчетаЗапроса.Свойство("ПараметрыЗаполнения", ПараметрыЗаполненияЗапроса);
	КонецЕсли;

	ТранспортныйКонтейнер.Вставить("КонфигурацияИмя", 
		Строка(УдалитьВерсиюИзНаименованияКонфигурации(ИнтернетПоддержкаПользователей.СинонимКонфигурации())));
	ТранспортныйКонтейнер.Вставить("КонфигурацияВерсия", ИнтернетПоддержкаПользователей.ВерсияКонфигурации());
	ТранспортныйКонтейнер.Вставить("ВерсияБРО", Отчетность24БРО.ВерсияБРО());
	
	РезультатJSON = Отчетность24БРОСериализация.ЗначениеВJSON(Результат);
	РезультатУпакованный = XMLСтрока(Новый ХранилищеЗначения(РезультатJSON, Новый СжатиеДанных(9)));
	ТранспортныйКонтейнер.Вставить("РезультатЗаполнения", РезультатУпакованный);

КонецПроцедуры

Процедура ОбработатьОтложенныеЗапросы() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗапросыПодтверждения.Идентификатор КАК Идентификатор,
	|	ЗапросыПодтверждения.Получатель КАК Получатель,
	|	ЗапросыПодтверждения.Отправитель КАК Отправитель,
	|	ЗапросыПодтверждения.ИДОтчета КАК ИДОтчета,
	|	ЗапросыПодтверждения.ИДРедакцииОтчета КАК ИДРедакцииОтчета,
	|	ЗапросыПодтверждения.ИмяТипа КАК ИмяТипа,
	|	ЗапросыПодтверждения.ТелоЗапроса КАК ТелоЗапроса,
	|	ЗапросыПодтверждения.Подтверждено КАК Подтверждено,
	|	ЗапросыПодтверждения.Отклонено КАК Отклонено,
	|	Отчетность24Подключения.Госорганы КАК Госорганы
	|ИЗ
	|	РегистрСведений.Отчетность24БРОЗапросы КАК ЗапросыПодтверждения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Отчетность24БРОПодключения КАК
	|			Отчетность24Подключения
	|		ПО ЗапросыПодтверждения.Отправитель = Отчетность24Подключения.Получатель
	|ГДЕ
	|	ЗапросыПодтверждения.Подтверждено = ИСТИНА
	|	ИЛИ ЗапросыПодтверждения.Отклонено = ИСТИНА";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;

	Выборка = Новый Структура();
	Выборка.Вставить("Идентификатор", "");
	Выборка.Вставить("Получатель", "");
	Выборка.Вставить("Отправитель", "");
	Выборка.Вставить("ИДОтчета", "");
	Выборка.Вставить("ИДРедакцииОтчета", "");
	Выборка.Вставить("ИмяТипа", "");
	Выборка.Вставить("ТелоЗапроса", "");
	Выборка.Вставить("Подтверждено", ложь);
	Выборка.Вставить("Отклонено", Ложь);
	Выборка.Вставить("Госорганы", "");
	
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(Выборка, ВыборкаЗапроса);
		
		Если Выборка.ТелоЗапроса = "" Тогда
			УдалитьЗапросИзОчереди(Выборка.Идентификатор);
			Продолжить;
		КонецЕсли;

		Попытка
			ДанныеЗапроса = Отчетность24БРОСериализация.JSONВЗначение(Выборка.ТелоЗапроса, Ложь);
		Исключение
			ОписаниеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
				ЗаписьЖурналаРегистрации(
				ИмяСобытияЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
			Возврат;
		КонецПопытки;
	
		ВходящийКонтейнер = Неопределено;
		
		ИмяСвойстваКонтейнер = "Контейнер";

		Если ТипЗнч(ДанныеЗапроса) = Тип("Структура") И ДанныеЗапроса.Свойство(ИмяСвойстваКонтейнер, ВходящийКонтейнер) Тогда
			
			Если ТипЗнч(ВходящийКонтейнер) = Тип("Строка") Тогда
				ВходящийКонтейнерХранилище = XMLЗначение(Тип("ХранилищеЗначения"), ВходящийКонтейнер); // ХранилищеЗначения
				Если ВходящийКонтейнерХранилище <> Неопределено Тогда
					КонтейнерJSON = ВходящийКонтейнерХранилище.Получить(); // Строка
					Попытка
						НовыйВходящийКонтейнер = Отчетность24БРОСериализация.JSONВЗначение(КонтейнерJSON, Ложь);
					Исключение
						ОписаниеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
						ЗаписьЖурналаРегистрации(
						ИмяСобытияЖурналаРегистрации(),
						УровеньЖурналаРегистрации.Ошибка,,,
						ОписаниеОшибки);
						Возврат;
					КонецПопытки;
					ДанныеЗапроса[ИмяСвойстваКонтейнер] = НовыйВходящийКонтейнер;
				КонецЕсли;
			КонецЕсли;	
			
		КонецЕсли;
		
		
		ИмяТипа = "";
		Если ЗначениеЗаполнено(Выборка.ИмяТипа) Тогда
			ИмяТипа = Выборка.ИмяТипа;
		КонецЕсли;
		
		ИДОтчета = "";
		ИДРедакцииОтчета = "";
		Если Не ЗначениеЗаполнено(ИмяТипа) И 
			(ДанныеЗапроса.Свойство("ИДОтчета", ИДОтчета) = Ложь 
				Или ДанныеЗапроса.Свойство("ИДРедакцииОтчета", ИДРедакцииОтчета) = Ложь) Тогда
			УдалитьЗапросИзОчереди(Выборка.Идентификатор);
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИмяТипа) Тогда
			ГосорганОтчета = ИнтеграцияСОтчетность24КлиентСервер.ГосорганПоИмениТипа(ИмяТипа);
		Иначе
			ГосорганОтчета = ГосорганОтчета(ИДОтчета);
		КонецЕсли;
		
		ТранспортныйКонтейнер = НовыйТранспортныйКонтейнер();
		
		Если Выборка.Отклонено Тогда
			ТранспортныйКонтейнер.ДоступРазрешен = Ложь;
			ТранспортныйКонтейнер.ТекстОшибки = НСтр("ru = 'Передача данных по этому отчету отклонена
			|пользователем учетной базы'");
		ИначеЕсли Не ЗначениеЗаполнено(ГосорганОтчета) Тогда
			ТранспортныйКонтейнер.ДоступРазрешен = Истина;
		Иначе
			ТранспортныйКонтейнер.Госорган = ГосорганОтчета;
			Если СтрНайти(Выборка.Госорганы, ГосорганОтчета) = 0 Тогда
				ТранспортныйКонтейнер.ДоступРазрешен = Ложь;
				ТранспортныйКонтейнер.ТекстОшибки = НСтр("ru = 'Доступ к данным для заполнения отчета в'") 
					+ СтрШаблон(" %1 запрещен", ГосорганОтчета);
			Иначе
				ТранспортныйКонтейнер.ДоступРазрешен = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ТранспортныйКонтейнер.ДоступРазрешен Тогда
			ДобавитьРезультатЗаполненияВТранспортныйКонтейнер(ТранспортныйКонтейнер, ДанныеЗапроса);
		Иначе
			ТранспортныйКонтейнер.Вставить("ЕстьВерсия");
		КонецЕсли;
		
		ОтправитьТранспортныйКонтейнер(ТранспортныйКонтейнер, Выборка.Получатель, Выборка.Отправитель, Выборка.Идентификатор); 
		
		УдалитьЗапросИзОчереди(Выборка.Идентификатор);
	КонецЦикла;
	
КонецПроцедуры  

Процедура РегламентноеЗаданиеПолучениеСообщенийИзОтчетность24() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ПолучениеСообщенийИзОтчетность24);
	
	ОтборЗаданий = Новый Структура();
	ОтборЗаданий.Вставить("ИмяМетода", "ИнтеграцияСОтчетность24.ПолучитьСообщенияПоHttp");
	ОтборЗаданий.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	АктивныеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборЗаданий);
	
	Если АктивныеЗадания.Количество()>0 Тогда
		Возврат;
	КонецЕсли;

	ПолучитьСообщенияПоHttp();
	
КонецПроцедуры

// Получить контейнер ответа по объекту.
// 
// Параметры:
//  Объект - СправочникОбъект, ДокументОбъект - 
// 
// Возвращаемое значение:
//  Структура
Функция ПолучитьКонтейнерОтветаПоОбъекту(Объект) Экспорт

	Результат = Новый Структура; 
	
	МетаданныеОбъекта = Объект.Метаданные();
	
	Результат = Новый Структура;
	Для Каждого Реквизит Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл 
		Результат.Вставить(Реквизит.Имя, Объект[Реквизит.Имя]);		
	КонецЦикла;

	Для Каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл 
		Результат.Вставить(Реквизит.Имя, Объект[Реквизит.Имя]);		
	КонецЦикла;
	
	Для Каждого ТабЧасть Из МетаданныеОбъекта.ТабличныеЧасти Цикл 
		МассивТабЧасти = Новый Массив; // Массив Из Структура
		Для Каждого СтрокаОбъекта Из Объект[ТабЧасть.Имя] Цикл // СтрокаТабличнойЧасти
			СтруктураСтроки = Новый Структура;
			Для Каждого КолокаТабЧасти Из ТабЧасть.Реквизиты Цикл 
				СтруктураСтроки.Вставить(КолокаТабЧасти.Имя, СтрокаОбъекта[КолокаТабЧасти.Имя]);		
			КонецЦикла;     
			МассивТабЧасти.Добавить(СтруктураСтроки);	
		КонецЦикла;
		Результат.Вставить(ТабЧасть.Имя, МассивТабЧасти);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Загрузить контейнер в объект.
// 
// Параметры:
//  Объект           - ДокументОбъект, СправочникОбъект - 
//  ДанныеЗаполнения - Структура
Процедура ЗагрузитьКонтейнерВОбъект(Объект, ДанныеЗаполнения) Экспорт
	
	МетаданныеОбъекта = Объект.Метаданные();
	
	Для Каждого Реквизит Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл   
		ЗначениеРеквизита = Неопределено;
		Если ДанныеЗаполнения.Свойство(Реквизит.Имя, ЗначениеРеквизита) Тогда
			Объект[Реквизит.Имя] = ЗначениеРеквизита;
		КонецЕсли;
	КонецЦикла;  
	
	Для Каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл   
		ЗначениеРеквизита = Неопределено;
		Если ДанныеЗаполнения.Свойство(Реквизит.Имя, ЗначениеРеквизита) Тогда
			Объект[Реквизит.Имя] = ЗначениеРеквизита;
		КонецЕсли;
	КонецЦикла;  
	
	Для Каждого ТабЧасть Из МетаданныеОбъекта.ТабличныеЧасти Цикл
		МассивСтрок = Неопределено;
		Если ДанныеЗаполнения.Свойство(ТабЧасть.Имя, МассивСтрок) И ТипЗнч(МассивСтрок) = Тип("Массив") Тогда
			ОбъектТабЧасть = Объект[ТабЧасть.Имя]; // ТабличнаяЧасть
			Для Каждого СтруктураСтроки Из МассивСтрок Цикл
				ЗаполнитьЗначенияСвойств(ОбъектТабЧасть.Добавить(), СтруктураСтроки)	
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

// Контрольная сумма тикета ИТС.
// 
// Параметры:
//  ТикетИТС - Строка
// 
// Возвращаемое значение:
//  Строка
Функция КонтрольнаяСуммаТикетаИТС(ТикетИТС) Экспорт
	
	Возврат Отчетность24БРО.КонтрольнаяСуммаТикетаИТС(ТикетИТС);
	 
КонецФункции

#Область ПодключениеКШинеОтчетности

// Сохраняет настройки подключения по результату рукопожатия с шиной
// Вызывается как из интерактивной формы записи регистра, так и из тихого подключения
// при первичной загрузке справочников
//
// Параметры:
//  РезультатПодключения - см. ИнтеграцияСОтчетность24ВызовСервера.Подключиться
//
// Возвращаемое значение:
//  Булево - Истина если настройки записаны
//
Функция СохранитьНастройкиПодключения(РезультатПодключения) Экспорт

	Получатель = "";
	Если Не РезультатПодключения.Свойство("Получатель", Получатель) Или Не ЗначениеЗаполнено(Получатель) Тогда
		Возврат Ложь;
	КонецЕсли;

	Запись = РегистрыСведений.Отчетность24БРОПодключения.СоздатьМенеджерЗаписи();
	Запись.Получатель = Получатель;
	Запись.Прочитать();
	ЭтоНоваяНастройка = Не Запись.Выбран();

	// Реквизиты подключения заполняются только при первом подключении.
	// Повторное подключение той же базы лишь дополняет список организаций.
	Если ЭтоНоваяНастройка Тогда
		ЗаполнитьЗначенияСвойств(Запись, РезультатПодключения);
		Запись.Получатель = Получатель;
		Запись.ТребоватьПодтверждениеПользователя = Истина;
		Запись.Имя = Запись.Имя
			+ ИнтеграцияСОтчетность24ВызовСервера.ИндексНаименованияНастройки(Запись.Имя, Получатель);
		Запись.Записать();
	КонецЕсли;

	Организации = Неопределено; // см. ЗаписатьОграничениеПоОрганизациям.Организации
	Если РезультатПодключения.Свойство("Организации", Организации) И ЗначениеЗаполнено(Организации) Тогда
		ЗаписатьОграничениеПоОрганизациям(Получатель, Организации);
	КонецЕсли;

	ЗаполнитьПользователейДляПодтвержденияОтправки(Получатель);

	Возврат Истина;

КонецФункции

#КонецОбласти

// Заполняет описания поставляемых профилей пользователей в подсистеме БСП "Управление доступом".
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииПоставляемыхПрофилейГруппДоступа()
//
// Параметры:
//  ОписаниеПрофилей - Массив Из см. УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа
//
Процедура ЗаполнитьПоставляемыеПрофилиПользователей(ОписаниеПрофилей) Экспорт
	
	ОписанияПрофилейОтчетности = Новый Массив; // Массив Из см. УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа
	ОписанияПрофилейОтчетности.Добавить(ОписаниеПрофиляПодтверждениеОтправкиДанныхВОтчетность());
	ОписанияПрофилейОтчетности.Добавить(ОписаниеПрофиляСозданиеНастроекПодключенияКОтчетности());
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ОписаниеПрофилей, ОписанияПрофилейОтчетности);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Конструктор структуры транспортного контейнера
// 
// Возвращаемое значение:
//  Структура:
// * Госорган         - Строка - 
// * ДоступРазрешен   - Булево - 
// * ИДОтчета         - Строка - 
// * ИДРедакцииОтчета - Строка - 
// * ИмяТипа          - Строка -
// * ТекстОшибки      - Строка - 
// * ПодробноеПредставлениеОшибки - Строка
// * ТекстРекомендаций - Строка 
Функция НовыйТранспортныйКонтейнер()
	
	Результат = Новый  Структура();
	Результат.Вставить("Госорган", "");
	Результат.Вставить("ДоступРазрешен", Ложь);
	Результат.Вставить("ИДОтчета", "");
	Результат.Вставить("ИДРедакцииОтчета", "");
	Результат.Вставить("ИмяТипа", "");
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("ПодробноеПредставлениеОшибки", "");
	Результат.Вставить("ТекстРекомендаций", "");
	
	Возврат Результат;
	
КонецФункции

// Описание профиля подтверждение отправки данных в отчетность.
// 
// Возвращаемое значение:
//  см. УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа
Функция ОписаниеПрофиляПодтверждениеОтправкиДанныхВОтчетность()
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = Метаданные.Роли.ПодтверждениеОтправкиДанныхВОтчетность24.Имя;
	ОписаниеПрофиля.Родитель      = "ДополнительныеПрофили";
	ОписаниеПрофиля.Идентификатор = "954328da-6978-4028-a933-f6e913eea3b0";
	ОписаниеПрофиля.Наименование  = Метаданные.Роли.ПодтверждениеОтправкиДанныхВОтчетность24.Синоним;
	ОписаниеПрофиля.Роли.Добавить(Метаданные.Роли.ПодтверждениеОтправкиДанныхВОтчетность24.Имя);
	
	Возврат ОписаниеПрофиля;

КонецФункции

// Описание профиля для создания подключений к Отчетности
// 
// Возвращаемое значение:
//  см. УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа
Функция ОписаниеПрофиляСозданиеНастроекПодключенияКОтчетности()
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = Метаданные.Роли.СозданиеНастроекПодключенияКОтчетность24.Имя;
	ОписаниеПрофиля.Родитель      = "ДополнительныеПрофили";
	ОписаниеПрофиля.Идентификатор = "a877a4af-50f7-4d80-b721-7eafe0d1e0b3";
	ОписаниеПрофиля.Наименование  = Метаданные.Роли.СозданиеНастроекПодключенияКОтчетность24.Синоним;
	ОписаниеПрофиля.Роли.Добавить(Метаданные.Роли.СозданиеНастроекПодключенияКОтчетность24.Имя);
	
	Возврат ОписаниеПрофиля;

КонецФункции

// Возвращает структуру адреса шины.
// 
// Возвращаемое значение:
//  см. Отчетность24БРО.АдресаШины 
Функция АдресаШины()
	
	Возврат Отчетность24БРО.АдресаШины();
	
КонецФункции

// Корректировка параметров отчета.
// 
// Параметры:
//  ПараметрыОтчета - Структура
//  ИДОтчета        - Строка
//  Контейнер       - Неопределено, Структура, Произвольный -
Процедура СкорректироватьПараметрыОтчета(ПараметрыОтчета, ИДОтчета, Контейнер)

	КлючСвойства = "АдресВоВременномХранилище";
	Если ПараметрыОтчета.Свойство(КлючСвойства) Тогда
		ПараметрыОтчета[КлючСвойства] = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	КонецЕсли;

	КлючСвойства = "АдресВременногоХранилищаРасшифровки";
	Если ПараметрыОтчета.Свойство(КлючСвойства) Тогда
		ПараметрыОтчета[КлючСвойства] = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	КонецЕсли;

	КлючСвойства = "АдресХранилища";
	Если ПараметрыОтчета.Свойство(КлючСвойства) Тогда
		ПараметрыОтчета[КлючСвойства] = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	КонецЕсли;

	КлючСвойства = "ИсточникДанныхДляОблака";
	Если ПараметрыОтчета.Свойство(КлючСвойства) И ТипЗнч(Контейнер) = Тип("Структура") И Не Контейнер.Свойство(
		КлючСвойства) Тогда
		Контейнер.Вставить(КлючСвойства, ПараметрыОтчета[КлючСвойства]);
	КонецЕсли;

	Для Каждого КлючИЗначение Из ПараметрыОтчета Цикл // КлючИЗначение
		Если ТипЗнч(КлючИЗначение.Значение) = Тип("ДокументСсылка.РегламентированныйОтчет") Тогда
				// Очищаем ссылки на отчеты чтобы они не были перезаписаны в учетной системе

			Если СтрНачинаетсяС(ИДОтчета, "РегламентированныйОтчетАлко") Тогда
					// Для заполнения и передачи данных регистров в конфигурацию Отчетность
				Если ТипЗнч(Контейнер) = Тип("Структура") И Не Контейнер.Свойство("Регистры") Тогда
					Контейнер.Вставить("Регистры", Новый Структура);
				КонецЕсли;
				ПараметрыОтчета[КлючИЗначение.Ключ] = Контейнер["Регистры"];
			Иначе
				ПараметрыОтчета[КлючИЗначение.Ключ] = Неопределено;
			КонецЕсли;

		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Возвращает актульную редакцию отчета в учетной базе
// 
// Параметры:
//  МетаданныеОтчета - ОбъектМетаданныхОтчет
//  ИДРедакцииОтчета - Строка - 
// 
// Возвращаемое значение:
//  Строка - Имя формы отчета
Функция ПодобратьРедакциюОтчета(МетаданныеОтчета, ИДРедакцииОтчета)

	Результат = Строка(ИДРедакцииОтчета);

	ПрефиксИмениФормы = "";
	МассивЦифр = "0123456789";
	Для СчетчикСимволов = 1 По СтрДлина(ИДРедакцииОтчета) Цикл
		ТекущийСимвол = Сред(ИДРедакцииОтчета, СчетчикСимволов, 1);
		Если СтрНайти(МассивЦифр, ТекущийСимвол) > 0 Тогда
			Прервать;
		Иначе
			ПрефиксИмениФормы = ПрефиксИмениФормы + ТекущийСимвол;
		КонецЕсли;
	КонецЦикла;

	Если ЗначениеЗаполнено(ПрефиксИмениФормы) Тогда
		МаксИмяФормы = "";

		Для Каждого ФормаОтчетаМетаданные Из МетаданныеОтчета.Формы Цикл // ОбъектМетаданных
			Если СтрНачинаетсяС(ФормаОтчетаМетаданные.Имя, Строка(ПрефиксИмениФормы)) И ФормаОтчетаМетаданные.Имя
				> МаксИмяФормы Тогда
				МаксИмяФормы = ФормаОтчетаМетаданные.Имя;
			КонецЕсли;
		КонецЦикла;

		Если ЗначениеЗаполнено(МаксИмяФормы) Тогда
			Результат = Строка(МаксИмяФормы);
		КонецЕсли;

	КонецЕсли;

	Возврат Результат;

КонецФункции

// Возвращает структуру заголовков сообщения.
// 
// Параметры:
//  КодПолучателя  - Неопределено, Строка -
//  КодОтправителя - Неопределено, Строка -
//  Идентификатор  - Неопределено, Строка -
// 
// Возвращаемое значение:
//  Структура:
// * КодПолучателя  - Строка 
// * КодОтправителя - Строка 
// * Идентификатор  - Строка 
Функция ЗаголовкиСообщения(КодПолучателя, КодОтправителя, Идентификатор)
	ЗаголовкиСообщения = Новый Структура;
	ЗаголовкиСообщения.Вставить("КодПолучателя", Строка(КодПолучателя));
	ЗаголовкиСообщения.Вставить("КодОтправителя", Строка(КодОтправителя));
	ЗаголовкиСообщения.Вставить("Идентификатор", Строка(Идентификатор));
	Возврат ЗаголовкиСообщения;
КонецФункции

// Удаляет запрос из очереди.
// 
// Параметры:
//  Идентификатор - Строка
Процедура УдалитьЗапросИзОчереди(Идентификатор) 

	МенеджерЗаписи = РегистрыСведений.Отчетность24БРОЗапросы.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Идентификатор = Идентификатор;
	МенеджерЗаписи.Удалить();
	
КонецПроцедуры

// Удаляет версию из наименования конфигурации.
// 
// Параметры:
//  Наименование - Строка - Наименование
// 
// Возвращаемое значение:
//  Строка
Функция УдалитьВерсиюИзНаименованияКонфигурации(Наименование)
	
	МассивЧастей = СтрРазделить(Наименование, " ");  
	
	Если МассивЧастей.Количество() = 1 Тогда
		Возврат Наименование;
	КонецЕсли;
	
	ПоследнееСлово = МассивЧастей[МассивЧастей.ВГраница()];
	ВключаетНомерРедакции = Истина;
	Для НомерСимвола = 1 По СтрДлина(ПоследнееСлово) Цикл    
		ТекущийСимвол = Сред(ПоследнееСлово, НомерСимвола, 1);
		Если СтрНайти("0123456789.", ТекущийСимвол) = 0 Тогда 
			ВключаетНомерРедакции = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;  
	
	Если ВключаетНомерРедакции = Ложь Тогда
		Возврат Наименование;
	КонецЕсли;               
	
	МассивЧастей.Удалить(МассивЧастей.ВГраница()); 
	
	Если НРег(МассивЧастей[МассивЧастей.ВГраница()]) = "редакция" Тогда
		МассивЧастей.Удалить(МассивЧастей.ВГраница());
	КонецЕсли;   
	
	Результат = СтрСоединить(МассивЧастей, " ");
	
	Если Прав(Результат, 1) = "," Тогда
		Результат = Лев(Результат, СтрДлина(Результат) - 1);	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Реализовано заполнение на форме.
// 
// Параметры:
//  ИДОтчета                      - Строка 
//  ИДРедакцииОтчетаДляЗаполнения - Строка 
//  ПараметрыФормированияОтчета   - Структура
// 
// Возвращаемое значение:
//  Булево
Функция РеализованоЗаполнениеНаФорме(Знач ИДОтчета, Знач ИДРедакцииОтчетаДляЗаполнения, ПараметрыФормированияОтчета)

	Показатели = Неопределено;

	ИмяФормыОтчета = ИДРедакцииОтчетаДляЗаполнения;
	ПараметрыОтчета = ОбщегоНазначения.СкопироватьРекурсивно(ПараметрыФормированияОтчета);
	
	Попытка
		НастройкиВидимости = РегламентированнаяОтчетность.НоваяСтруктураНастроекВидимостиЭлементаФормы();
		РегламентированнаяОтчетностьПереопределяемый.ПолучитьНастройкиВидимостиЭлементовФормы(
			ИДОтчета, ИмяФормыОтчета, НастройкиВидимости);

		Если НастройкиВидимости.ПостояннаяВидимость Тогда
			Показатели = НастройкиВидимости;
		Иначе

			Если СтрНачинаетсяС(ИДОтчета, "РегламентированныйОтчетБухОтчетность") Тогда
				Показатели = Истина;
			Иначе
				ОтображатьКнопкуЗаполнить = Ложь;
				Попытка
					СтруктураРеквизитовФормы = Новый Структура;
					ОтчетОбъект = Отчеты[ИДОтчета].Создать();
				//@skip-check dynamic-access-method-not-found
					ОтчетОбъект.СформироватьСтруктуруРеквизитовФормы(ИмяФормыОтчета, СтруктураРеквизитовФормы);
					ПараметрыОтчета.Вставить("СтруктураРеквизитовФормы", СтруктураРеквизитовФормы);
					СтруктураРеквизитовФормы.Свойство("ОтображатьКнопкуЗаполнить", ОтображатьКнопкуЗаполнить);
				Исключение
					ОтображатьКнопкуЗаполнить = Ложь;
				КонецПопытки;

				Если ОтображатьКнопкуЗаполнить = Истина Тогда
					Показатели = НастройкиВидимости;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Исключение
		Показатели = Неопределено;
	КонецПопытки;
	
	Если Показатели = Неопределено Тогда 
		Попытка
			Показатели = РегламентированнаяОтчетностьПереопределяемый.ПолучитьСведенияОПоказателяхОтчета(
					ИДОтчета, ИмяФормыОтчета, ПараметрыОтчета);
		Исключение
			Показатели = Неопределено;
		КонецПопытки;
	КонецЕсли;
	
	Возврат ЗначениеЗаполнено(Показатели);
	
КонецФункции

// Возвращает значение заголовка HTTP по имени (регистронезависимый)
//
// Параметры:
//  ЗаголовкиHTTP	 - Соответствие Из КлючИЗначение:
//  * Ключ - Строка
//  * Значение - Строка
//  ИмяЗаголовка	 - Строка
// 
// Возвращаемое значение:
//   Неопределено, Строка -
Функция ЗначениеЗаголовкаHTTP(ЗаголовкиHTTP, ИмяЗаголовка)
	
	Возврат Отчетность24БРО.ЗначениеЗаголовкаHTTP(ЗаголовкиHTTP, ИмяЗаголовка);
	
КонецФункции

#Область ПодключениеКШинеОтчетности

// Записывает whitelist организаций получателя в регистр ограничения передачи данных
//
// Параметры:
//  Получатель - Строка - код получателя настройки
//  Организации - Массив Из СправочникСсылка.Организации - организации разрешенные для передачи
//
Процедура ЗаписатьОграничениеПоОрганизациям(Получатель, Организации)

	Если Не ЗначениеЗаполнено(Получатель) Или Организации = Неопределено Тогда
		Возврат;
	КонецЕсли;

	МассивОрганизаций = Новый Массив(); // см. ЗаписатьОграничениеПоОрганизациям.Организации
	Для Каждого Организация Из Организации Цикл

		Если Не ЗначениеЗаполнено(Организация) Тогда
			Продолжить;
		КонецЕсли;

		Если МассивОрганизаций.Найти(Организация) = Неопределено Тогда
			МассивОрганизаций.Добавить(Организация);
		КонецЕсли;
	КонецЦикла;

	НаборОграничений = РегистрыСведений.Отчетность24БРООграниченияПоОрганизациям.СоздатьНаборЗаписей();
	НаборОграничений.Отбор.Получатель.Установить(Получатель);
	Для Каждого Организация Из МассивОрганизаций Цикл
		НоваяЗапись = НаборОграничений.Добавить();
		НоваяЗапись.Получатель = Получатель;
		НоваяЗапись.Организация = Организация;
	КонецЦикла;
	НаборОграничений.Записать();

КонецПроцедуры

// Заполняет пользователей учетной базы для подтверждения отправки по получателю
//
// Параметры:
//  Получатель - Строка - код получателя настройки
Процедура ЗаполнитьПользователейДляПодтвержденияОтправки(Получатель)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НастройкиПодтвержденияПередачиДанныхВОблачнуюОтчетность.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.Отчетность24БРОНастройкиПодтверждения КАК
		|		НастройкиПодтвержденияПередачиДанныхВОблачнуюОтчетность
		|ГДЕ
		|	НастройкиПодтвержденияПередачиДанныхВОблачнуюОтчетность.РазрешеноПодтверждениеОтправки
		|	И НастройкиПодтвержденияПередачиДанныхВОблачнуюОтчетность.Получатель = &Получатель";

	Запрос.УстановитьПараметр("Получатель", Получатель);

	РезультатЗапроса = Запрос.Выполнить();

	МассивПользователей = Новый Массив(); // Массив Из ОпределяемыйТип.Пользователь
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ВыборкаПользователь = Выборка["Пользователь"]; // ОпределяемыйТип.Пользователь
		
		Если Не ЗначениеЗаполнено(ВыборкаПользователь) Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеСписка = МассивПользователей.Найти(ВыборкаПользователь);
		Если ЗначениеСписка = Неопределено Тогда
			МассивПользователей.Добавить(ВыборкаПользователь);
		КонецЕсли;
		
	КонецЦикла;

	Для Каждого Пользователь Из МассивПользователей Цикл // ОпределяемыйТип.Пользователь
		ЗаписьПодтверждения = РегистрыСведений.Отчетность24БРОНастройкиПодтверждения.СоздатьМенеджерЗаписи();
		ЗаписьПодтверждения.Получатель = Получатель;
		ЗаписьПодтверждения.Пользователь = Пользователь;
		ЗаписьПодтверждения.РазрешеноПодтверждениеОтправки = Истина;
		ЗаписьПодтверждения.Записать();
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецОбласти
